In [5]:
import pandas as pd

In [7]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

In [11]:
df.head()

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35]}
df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [15]:
data = [10, 20, 30, 40]
s = pd.Series(data, name='Numbers')

In [17]:
s

0    10
1    20
2    30
3    40
Name: Numbers, dtype: int64